{
  "0": {
    "name": "Dzung (David) Nguyen",
    "email": "dzungnguyen179@gmail.com",
    "profile-image":"/static/img/logo.png",
    "address": "Nguyen Trai, District 1, HCMC, Vietnam",
    "phone": "0908774321",
    "current-title":"Senior Software Engineer at Chợ Tốt",
    "socials": [
      "https://github.com/davidnguyen179"
    ]
  },
  "1": {
    "text": "Work Experience",
    "data": [
      {
        "company_name": "Chợ Tốt",
        "title": "Senior Software Engineer",
        "time": "Jan 2018 – Present",
        "accomplishments": [
          "Designed and rebuilt the Front-End web platform architecture which helped products scalable, reduced complexity, speeded up development, better code maintainability, better reusable code, increase the quality and the consistency of the product ecosystem.",
          "Designed and Built the Design System which made styles of products consistent, speeded up development and became the main communication channel of Engineer, Designer, and Product team.",
          "Rebuilt the main navigation allows easily to scale up and helped the product ecosystem connected tightly.",
          "Brainstorm & Implemented Growth Hacking ideas which helped to drive more than 50k daily active users per day.",
          "Designed and built the parser system which allows easily developing cross-platform features and increases the quality of the mobile platform.",
          "Optimized the deployment process of the web platform which improves the productivity of web team and less depending on the DevOps team."
        ]
      },
      {
        "company_name": "Chợ Tốt",
        "title": "Software Engineer, Front-End",
        "time": "Oct 2016 – Jan 2018",
        "accomplishments": [
          "Designed and implemented an SEO system which helps websites scale from 655k visits/day to more than 755k visits/day.",
          "Built highly scalable web apps that scaled to over millions of users.",
          "Built the simplified mobile version of Chợ Tốt marketplace optimized for old devices which helped to take back more than 12k visits/day.",
          "Author of 5 open source projects of Chợ Tốt: react-paginating, create next app, search suggestion, s3-uploading and with-click-outside, which help 3 teams save time on developing new features.",
          "Redesigned and implemented search and advanced filter features which allowed the site to scale for business expansion and cross-platform development.",
          "Designed dynamic loading system which helped websites loads web components separately and asynchronously to speed up website performance.",
          "Optimized website performance which helped speed up load-time and increase user engagement.",
          "Created libraries which are being used across products and made user interfaces of products consistent.",
          "Made dozens of improvements in other products and internal tools.",
          "Building tools to help improve productivity of engineers and other departments."
        ]
      },
      {
        "company_name": "SoSub – Volunteer",
        "title": "Software Engineer, Front-End",
        "time": "Sep 2016 – Dec 2017",
        "accomplishments": [
          "Led the redesign and implementation of an educational video web platform with a scalable front-end architecture and responsive user interfaces which are well-supported on desktop & mobile devices.",
          "Helped design and implement a video web component which allows embedding custom subtitles to videos.",
          "Optimized website performance which helped speed up load-time."
        ]
      },
      {
        "company_name": "Posiba",
        "title": "Software Engineer, Front-End",
        "time": "Dec 2015 – Sep 2016",
        "accomplishments": [
          "Helped design and implement a CSS framework which gave products a consistent style to avoid duplicate code.",
          "Created supporting materials with newest technologies to speed up development."
        ]
      },
      {
        "company_name": "Nash Tech",
        "title": "Software Engineer, Front-End",
        "time": "Jul 2014 – Dec 2015",
        "accomplishments": [
          "Redesigned and implemented a Front-End architecture for resume management system which helps the HR department easily manage information of more than 1k employees.",
          "Created a brand new internal system for code sharing that allows internal teams to share experiences and ask questions.",
          "Maintained and built new features for the e-voucher & e-gift card system."
        ]
      }
    ]
  },
  "2": {
    "text": "Education",
    "data": [
      {
        "school_name": "Vietnam National HCM University of Science",
        "time": "Nov 2014",
        "gpa": "3.2",
        "degree": "Bachelor's degree",
        "field_of_study": "Computer Software Engineering",
        "publications": [
          "Paper Information Extraction and Integration Based Crowd-Sourcing platform in Real-World published on ACOMP 2014 conference."
        ]
      }
    ]
  },
  "3": {
    "text": "Projects",
    "data": [
      {
        "project_name": "Chợ Tốt Growth Hacking ideas",
        "time": "2018 - Now",
        "description": ""
      },
      {
        "project_name": "Chợ Tốt parser system",
        "time": "2018 - Now",
        "description": ""
      },
      {
        "project_name": "Chợ Tốt marketplace",
        "time": "2016 - Now",
        "description": "Chotot.com is the leading marketplace providing an effective online marketplace to help millions of Vietnamese buy and sell various types of products easily."
      },
      {
        "project_name": "Chợ Tốt SEO dynamic system",
        "time": "2017 - Now",
        "description": "The system provides user-interface which enables the SEO team to manage contents and integrates with core products to increase ranking, traffic and usability. It helped increase traffic by more than 100k visits/day."
      },
      {
        "project_name": "Chợ Tốt lite",
        "time": "2017",
        "description": "The lightweight version of Chợ Tốt marketplace which supports old devices and old browsers with a fast loading and optimized performance. It helped take back more than 12k visits/day."
      },
      {
        "project_name": "SoSub",
        "time": "2016 - 2017",
        "description": "A non-profit educational video platform that aims to encourage self-study and make global knowledge more accessible to Vietnamese people by providing English & Vietnamese subtitles with more than 50k monthly visits."
      }
    ]
  },
  "4": {
    "text": "Skills",
    "data": [
      {
        "languages": "JavaScript, TypeScript, Python, CSS, C#, C/C++, SQL."
      },
      {
        "technologies": "ReactJS, Redux, GraphQL, Jest, Enzyme, NextJS, NodeJS, Docker."
      },
      {
        "softwares": "WebStorm, Visual Studio Code."
      }
    ]
  },
  "5": {
    "text": "Award",
    "data": [
      "Top 3 Forbes Vietnam competitions of education platform startup sosub.org"
    ]
  },
  "6": {
    "text": "Publications",
    "data": [
      { "text": "Introducing React Paginating.", "link": "https://codeburst.io/introducing-react-paginating-9128f30f1f6b" },
      { "text": "NextJS multiple environments build.", "link": "https://codeburst.io/nextjs-multiple-environment-builds-e8b2ccb11c04" },
      { "text": "next.js at Chợ Tốt.", "link": "https://codeburst.io/next-js-at-chotot-ca9c1520f436" },
      { "text": "Hybrid front-end development environment with webpack.", "link": "https://medium.com/@dzungnguyen179/hybrid-front-end-development-environment-with-webpack-c713764578ac" },
      { "text": "The Benefits of Inheritance via @extend in Sass.", "link": "https://www.sitepoint.com/the-benefits-of-inheritance-via-extend-in-sass/" }
    ]
  }
}